content/index.org
#+TITLE: Personal Knowledge Base
#+AUTHOR: Kyeong Soo Choi
#+DATE: 2025-12-14
#+STARTUP: overview
#+OPTIONS: toc:2
#+PROPERTY: header-args :tangle no :results none

* Welcome

This is my personal knowledge base and configuration repository, built with Org-mode and published to GitHub Pages. It contains technical notes, learning resources, and editor configurations written in literate programming style.

** What's Here

- *Editor Configurations*: Emacs and Neovim setups with detailed explanations
- *AI Agent Configs*: Claude Code slash commands, skills, and MCP integrations
- *Learning Notes*: Programming books (SICP, K&R C), tools, and documentation
- *System Setup*: Linux configuration, dotfiles, and system administration

** Features

- Literate Programming: All configurations are documented and explainable
- Floating TOC: Easy navigation with sticky table of contents
- Dark Mode: Automatic theme switching based on system preference
- Responsive: Works on desktop, tablet, and mobile devices

* Emacs

Complete Emacs configuration and learning resources using literate programming with Org-mode.

** [[file:emacs/emacs-configs.org][Emacs Configurations]]

My complete Emacs configuration written in literate programming style. The configuration is split into focused, modular files for better organization and maintainability.

*Structure*:
- 13 main configuration modules (early-init, init, theme, window, completion, etc.)
- 5 programming language modules (general, web, Python, Ruby)
- All configs include detailed inline documentation
- Tangle support to generate =~/.emacs.d/= files

*Highlights*:
- Performance optimizations and native compilation setup
- Custom mode line with clean, minimal design
- Modern completion framework (Corfu)
- LSP support for multiple languages
- Git integration with Magit

*Total*: ~4,000 lines across 18 modular files

See also: [[file:emacs/configs/README.org][Configuration Guide]] | [[file:emacs/configs/programming/README.org][Programming Config Guide]]

** [[file:neovim/configs/README.org][Neovim Configurations]]

Minimal, efficient Neovim configuration following suckless philosophy.

*Highlights*:
- Lua-based configuration with lazy loading
- LSP support for multiple languages (Python, Ruby, TypeScript, Lua)
- Telescope for fuzzy finding
- Treesitter for syntax highlighting
- Mason for LSP management

*Total*: ~800 lines across 5 modules

** [[file:emacs/emacs-lisp.org][Learning Emacs Lisp]]

Comprehensive guide to Emacs Lisp for experienced developers. Covers the language from basics to advanced topics with practical examples.

*Topics*:
- Language fundamentals (data types, functions, variables)
- Control structures and iteration
- Lists and data structures
- Object-oriented programming with EIEIO
- Macros and metaprogramming
- Buffer manipulation and text processing
- Mode development
- Package management

*Format*: Tutorial-style with executable code blocks and exercises

*Size*: ~1,150 lines

** [[file:emacs/emacs-build.org][Building Emacs from Source]]

Step-by-step guide for building Emacs from source code on various platforms.

*Contents*:
- Prerequisites and dependencies
- Build configuration options
- Native compilation setup
- Platform-specific instructions
- Troubleshooting common build issues

*Platforms*: Linux, macOS, Windows

* Development Tools

Configuration and documentation for development tools and AI assistants.

** [[file:agents/claude-code/index.org][Claude Code Configurations]]

Literate configuration for Claude Code (Anthropic's AI coding assistant) written in Org-mode with comprehensive documentation.

*Structure*:
- Project settings and permissions
- Slash commands for common workflows (commit messages, org-roam capture)
- Agent skills organized by domain:
  - Core skills (general development patterns)
  - Emacs integration skills
  - Language-specific skills (JavaScript, Python, Rails)
  - Documentation skills
- MCP server integrations (Emacs, filesystem)

*Format*: Literate programming with tangle support to =.claude/= directory

*Total*: ~3,500 lines across 11 modules

See also: [[file:agents/claude-code/README.org][Configuration Guide]]

* Learning

Notes and exercises from programming books and technical documentation. See [[file:learning/index.org][Learning Index]] for full listing.

** [[file:learning/sicp.org][Structure and Interpretation of Computer Programs]]

Study notes and exercises from the classic computer science textbook SICP (Abelson & Sussman).

*Chapters*:
1. Building Abstractions with Procedures - Functions, recursion, higher-order procedures
2. Building Abstractions with Data - Data abstraction, hierarchical data, symbolic data
3. Modularity, Objects, and State - Assignment, mutable data, concurrency
4. Metalinguistic Abstraction - Interpreters, lazy evaluation, logic programming
5. Computing with Register Machines - Machine simulation, compilation

*Language*: Scheme

** [[file:learning/the-c-programming-language-2nd-ed/the-c-programming-language-2nd-ed.org][The C Programming Language (K&R)]]

Complete text of "The C Programming Language, 2nd Edition" by Kernighan and Ritchie in Org-mode format.

*Coverage*: All chapters with code examples and exercises

** [[file:learning/GNU-sed.org][GNU sed - Stream Editor]]

Comprehensive guide to the GNU sed stream editor, from basics to advanced text processing.

*Topics*: Stream editor fundamentals, regular expressions, pattern/hold space, multi-line processing

* Notes

System configuration, dotfiles, and setup documentation.

** [[file:notes/archlinux-setup.org][Arch Linux Setup Guide]]

Personal guide for setting up and configuring Arch Linux from scratch.

*Contents*:
- Installation procedure
- Post-installation configuration
- Desktop environment setup
- Package management
- System maintenance

*Target*: Arch Linux and Arch-based distributions

** [[file:notes/dotfiles.org][Dotfiles Configuration]]

My personal dotfiles and system configuration files with explanations.

*Includes*:
- Shell configuration (zsh, bash)
- Terminal emulator configs
- Git configuration
- Development environment setup
- Custom scripts and utilities

*Total*: ~630 lines of documented configurations

* Recent Updates

- 2025-12-14: Reorganized Claude Code skills by domain (Emacs, JS, Python, Rails, Docs)
- 2025-12-14: Simplified slash commands (commit-message, roam-capture)
- 2025-12-14: Updated index files and documentation
- 2025-12-01: Added Neovim configuration modules
- 2025-11-20: Split programming configurations by language (web, Python, Ruby)
- 2025-11-20: Added floating TOC sidebar with mobile toggle
- 2025-11-19: Restructured Emacs configs into modular files

* Navigation

** By Category

| Category                                    | Files | Description                          |
|---------------------------------------------+-------+--------------------------------------|
| [[*Emacs][Emacs]]                           |    21 | Emacs config modules + learning      |
| [[file:neovim/configs/README.org][Neovim]]  |     5 | Neovim Lua configuration             |
| [[*Development Tools][Claude Code]]         |    11 | AI assistant commands, skills, MCP   |
| [[*Learning][Learning]]                     |     3 | SICP, K&R C, GNU sed                 |
| [[*Notes][Notes]]                           |     2 | System setup and dotfiles            |
| [[file:dotfiles/index.org][Dotfiles]]       |     5 | IdeaVim, Alacritty, Zellij, etc.     |

** Quick Links

*** Editor Configs
- [[file:emacs/emacs-configs.org][Emacs Configuration]] - Main literate config file
- [[file:neovim/configs/README.org][Neovim Configuration]] - Lua-based config
- [[file:emacs/configs/programming/README.org][Programming Setup]] - Language-specific configs

*** AI & Tools
- [[file:agents/claude-code/index.org][Claude Code Configs]] - Commands, skills, MCP servers
- [[file:agents/claude-code/README.org][Claude Code Guide]] - How to use and customize

*** External
- [[https://github.com/mandoo180][GitHub Profile]] - Source code and other projects
- [[https://mandoo180.github.io][Live Site]] - Published version of this knowledge base

* About This Site

** Technical Details

- *Generator*: Emacs Org-mode (ox-publish)
- *Styling*: Vanilla CSS with GitHub Flavored Markdown design
- *Hosting*: GitHub Pages
- *Source*: [[https://github.com/mandoo180/mandoo180.github.io][mandoo180/mandoo180.github.io]]

** Building Locally

#+begin_src bash
  # Clone repository
  git clone https://github.com/mandoo180/mandoo180.github.io
  cd mandoo180.github.io

  # Build site
  ./build.sh

  # Serve locally (in Emacs)
  M-x package-install RET simple-httpd RET
  M-x httpd-serve-directory RET ./public RET
#+end_src

** Tangling Emacs Configs

#+begin_src bash
  # Extract all configurations to ~/.emacs.d/
  ./tangle.sh
#+end_src

* Contact

Feel free to explore, reference, or adapt any content for your own use.

- *GitHub*: [[https://github.com/mandoo180][@mandoo180]]
- *Email*: Available in GitHub profile
- *Site*: [[https://mandoo180.github.io][mandoo180.github.io]]

---

/Last updated: 2025-12-14/
